## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # module.argocd.module.argocd_application_controller.kubernetes_deployment.argocd_application_controller will be created
+   resource "kubernetes_deployment" "argocd_application_controller" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "application-controller"
+               "app.kubernetes.io/name"      = "argocd-application-controller"
+               "app.kubernetes.io/part-of"   = "argocd"
+               "istio-injection"             = "enabled"
            }
+           name             = "argocd-application-controller"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = (known after apply)
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app.kubernetes.io/name" = "argocd-application-controller"
                }
            }

+           strategy {
+               type = "Recreate"

+               rolling_update {
+                   max_surge       = (known after apply)
+                   max_unavailable = (known after apply)
                }
            }

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "app.kubernetes.io/name"    = "argocd-application-controller"
+                       "app.kubernetes.io/part-of" = "argocd"
+                       "istio-injection"           = "enabled"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }

+               spec {
+                   automount_service_account_token  = false
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   service_account_name             = "argocd-application-controller"
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       command                    = [
+                           "argocd-application-controller",
+                           "--status-processors",
+                           "20",
+                           "--operation-processors",
+                           "10",
+                           "--repo-server-timeout-seconds",
+                           "300",
+                           "--redis",
+                           "argocd-redis:6379",
                        ]
+                       image                      = "docker.io/argoproj/argocd:v2.4.0"
+                       image_pull_policy          = "Always"
+                       name                       = "argocd-application-controller"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       liveness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 5
+                           period_seconds        = 10
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           http_get {
+                               path   = "/healthz"
+                               port   = "8082"
+                               scheme = "HTTP"
                            }
                        }

+                       port {
+                           container_port = 8082
+                           protocol       = "TCP"
                        }

+                       readiness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 5
+                           period_seconds        = 10
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           http_get {
+                               path   = "/healthz"
+                               port   = "8082"
+                               scheme = "HTTP"
                            }
                        }

+                       resources {
+                           limits   = (known after apply)
+                           requests = (known after apply)
                        }

+                       volume_mount {
+                           mount_path        = "/var/run/secrets/kubernetes.io/serviceaccount/"
+                           mount_propagation = "None"
+                           name              = "service-token"
+                           read_only         = true
                        }
                    }

+                   image_pull_secrets {
+                       name = (known after apply)
                    }

+                   readiness_gate {
+                       condition_type = (known after apply)
                    }

+                   volume {
+                       name = "service-token"

+                       secret {
+                           default_mode = "0644"
                        }
                    }
                }
            }
        }
    }

  # module.argocd.module.argocd_application_controller.kubernetes_service_account.argocd_application_controller will be updated in-place
!   resource "kubernetes_service_account" "argocd_application_controller" {
        id                              = "kube-argocd/argocd-application-controller"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-application-controller-token-66zb2" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.argocd.module.argocd_server.kubernetes_service_account.server_service_account will be updated in-place
!   resource "kubernetes_service_account" "server_service_account" {
        id                              = "kube-argocd/argocd-server"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-server-token-9lj58" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-bfvbx" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
